КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул1/КонтурЛогистика_ПЭ_Титул1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЭ_Титул1</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭксп</name>
    <comment>Уникальный идентификатор документа (УИД) электронного поручения экпедитору, Выдается государственной информационной системой электронных перевозочных документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭкспОтз</name>
    <comment>УИД отозванного электронного поручения экспедитору, вместо которого сформировано данное электронное поручение экспедитору</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДок</name>
    <comment>Дата выдачи поручения экспедитору</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвКлиент</name>
    <comment>Сведения о клиенте - заказчике экспедиции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СвЭксп</name>
    <comment>Сведения об экспедиторе</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДогТрЭксп</name>
    <comment>Реквизиты договора транспортной экспедиции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаимЭкСубСост</name>
    <comment>Наименование экономического субъекта, составляющего файл обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь1с</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквНаимДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквНомерДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДатаДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительШаблона</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийРедактированияШаблона</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СценарииРедактированияШаблона</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВходящийШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументШаблон</name>
    <comment>Ссылка на документ шаблон, по которому было создано поручение</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>DefinedType.КонтурЛогистика_РазделительДокументаУчетнойСистемы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвГруз</name>
    <attributes>
      <name>ПЭ_СвГруз</name>
      <type>
        <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Предназначено для обмена информацией не предусмотренной форматом</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИныеДанныеКлт</name>
    <attributes>
      <name>ДанныеИОговорки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопрДок</name>
    <attributes>
      <name>РеквНаимДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквНомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвПредЗак</name>
    <comment>Указывается в случае, если клиент в свою очередь выступает организатором выполнения услуг, связанных с организацией перевозки груза, определенных договором транспортной экспедиции, заключенным с предшествующим заказчиком услуг</comment>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснованияМаршрутов</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ДвижениеДокументооборота/КонтурЛогистика_ДвижениеДокументооборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ДвижениеДокументооборота</name>
  <comment>время периода по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <comment>kl-status из сервиса: Титул.CustomData</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлОбмена</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ФайлыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналТранспорта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_КаналыТранспорта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииРедактированияШаблона/КонтурЛогистика_СценарииРедактированияШаблона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииРедактированияШаблона</name>
  <enumValues>
    <name>НеРедактируется</name>
    <comment>Шаблон для подписания</comment>
  </enumValues>
  <enumValues>
    <name>ДоступныВсеПоля</name>
    <comment>Документ, созданный из данного шаблона, контрагент сможет  отредактировать - внести дополнения по грузу, адресам или иным данным.</comment>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул1/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДанныеФормы();

	СоставляетИноеЛицо = Ложь;
	
	Если Объект.ЭтоВходящийШаблон
		И Не ЗначениеЗаполнено(Объект.ПользовательПодписант) Тогда 
	
		Объект.ПользовательПодписант = КонтурЛогистика_ОбщегоНазначенияСервер.ЗаполнитьРеквизитыПоПользователю(Объект.СвКлиент);
		Объект.Пользователь1с = Объект.ПользовательПодписант;
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если КодТекущегоСтатусаДокументооборота = "pe-wait-customer-sign"
		И Не ЗначениеЗаполнено(Объект.ПользовательПодписант) Тогда
		
		Объект.ПользовательПодписант = КонтурЛогистика_ОбщегоНазначенияСервер.ЗаполнитьРеквизитыПоПользователю(Объект.СвКлиент);
		Объект.Пользователь1с = Объект.ПользовательПодписант;
		Модифицированность = Истина;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ДоступностьРедактирования = (ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка
		Или КодТекущегоСтатусаДокументооборота = "pe-wait-customer-sign");
	УстановитьДоступностьКомандОтправки(ДоступностьРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.ЭтоШаблон И Не ЗначениеЗаполнено(Объект.ОтправительШаблона) Тогда
		Объект.ОтправительШаблона = Объект.СвЭксп;
	КонецЕсли;
	
	СоставляетИноеЛицо = Объект.ЭтоШаблон 
			И ((Не Объект.ОтправительШаблона = Объект.СвЭксп) Или СоставляетИноеЛицо);

	ПолностьюОбновитьПредставлениеДанных();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМаршруты;
	КонецЕсли;
	
	СформироватьЗаголовокГруппыРеквизитыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);

	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" 
		ИЛИ ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента_ПЭ_Партии"	Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
			  И Параметр <> Неопределено
			  И ТипЗнч(Параметр) = Тип("Массив")
			  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда

		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	ОбновитьФорму();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПодбораДокументов(МассивДокументов, ДополнительныеПараметры) Экспорт
	
	БылиИзменения = Ложь; 
	
	Если ТипЗнч(МассивДокументов) = Тип("Массив") Тогда
		
		ТабЧасть = МаршрутыГруза;
		Для Каждого Документ Из МассивДокументов Цикл
			
			Если ТабЧасть.НайтиСтроки(Новый Структура("МаршрутГруза", Документ)).Количество() = 0 Тогда
				НоваяСтрока = ТабЧасть.Добавить();
				НоваяСтрока.МаршрутГруза = Документ;
				БылиИзменения = Истина;
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
	Если БылиИзменения Тогда
		Модифицированность = Истина; 
		ПроверитьДокумент();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	МассивМаршрутов = ВыгрузитьМаршруты();	
	УстановитьТитулВДокументахМаршута(МассивМаршрутов, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомДокПриИзменении(Элемент)
	ПроверитьДокумент();
	ИзмененыКлючевыеРеквизиты = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	ПроверитьДокумент();
	ИзмененыКлючевыеРеквизиты = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвКлиентПриИзменении(Элемент)
	ПроверитьДокумент();
	ИзмененыКлючевыеРеквизиты = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвЭкспПриИзменении(Элемент)
	
	Если Объект.ЭтоШаблон И Не СоставляетИноеЛицо
		Или Не ЗначениеЗаполнено(Объект.ОтправительШаблона)  Тогда
		Объект.ОтправительШаблона = Объект.СвЭксп;
		Модифицированность = Истина; 
	КонецЕсли;
	
	СоставляетИноеЛицо = Объект.ЭтоШаблон 
			И ((Не Объект.ОтправительШаблона = Объект.СвЭксп) Или СоставляетИноеЛицо);
	
	ПроверитьДокумент();
	ИзмененыКлючевыеРеквизиты = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЭтоШаблонПриИзменении(Элемент)
	
	Если Объект.ЭтоШаблон Тогда
		Объект.ОтправительШаблона = Объект.СвЭксп;
		Если Не ЗначениеЗаполнено(Объект.СценарийРедактированияШаблона) Тогда
			Объект.СценарийРедактированияШаблона = ПолучитьСценарийРедактированияШаблонаНаСервере(); 
		КонецЕсли;	
	Иначе 
		Объект.ОтправительШаблона = Неопределено;
	КонецЕсли;	
	
	ПерепроверитьМаршрутыГрузаНаСервере();
	ПроверитьДокумент();
	УстановитьЗаголовки();
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСценарийРедактированияШаблонаНаСервере()
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЭ_ТипШаблонаДляОтправкиКонтрагенту");
КонецФункции

&НаКлиенте
Процедура ДогТрЭкспПриИзменении(Элемент)
	ПроверитьДокумент();
	ИзмененыКлючевыеРеквизиты = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СоставляетЭкспедиторПриИзменении(Элемент)
	
	Элементы.ОтправительШаблона.Видимость = Объект.ЭтоШаблон И СоставляетИноеЛицо;
	Элементы.СвЭксп.Заголовок = ?(Объект.ЭтоШаблон И Не СоставляетИноеЛицо, "Экспедитор (отправитель шаблона)", "Экспедитор");
	
	Если СоставляетИноеЛицо = Ложь Тогда
		Объект.ОтправительШаблона = Объект.СвЭксп; 
	КонецЕсли;
		
	ПроверитьДокумент();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительШаблонаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованияПриИзменении(Элемент)
	Элементы.ПерезаполнитьПоДокОснованию.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование) И Не Объект.ЭтоВходящийШаблон;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиСопрДок
&НаКлиенте
Процедура СопрДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиГрузы

&НаКлиенте
Процедура ГрузыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГрузыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиМаршрутыГруза

&НаКлиенте
Процедура МаршрутыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = ПолучитьПараметрыОткрытияМаршрутаНаСервере();
	ПараметрыФормы.Вставить("ОткрытоИзТитула", Истина);
	ПараметрыФормы.Вставить("Ключ", Элемент.ТекущиеДанные.МаршрутГруза);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Форма.ФормаДокумента", Параметрыформы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)

	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1"), Объект.ДокументОснование);

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоДокОснованию(Команда)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
			"Документ будет записан перед перезаполнением. Продолжить?",
			РежимДиалогаВопрос.ДаНет,
			,
			,
			ЭтаФорма,
			"ОбработчикЗаписиПередПерезаполнением");
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьПерезаполнениеПоДокОснованию();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗаписиПередПерезаполнением(Ответ, ДопПараметр = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПерезаполнениеПоДокОснованию();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПерезаполнениеПоДокОснованию()
	
	ПерезаполнитьПоДокОснованиюСервер();
	ОбновитьДанныеФормы();
	ПолностьюОбновитьПредставлениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)

	ОбработчикПеречитатьОбъект();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПараметрыПодписи(Команда)
	
	МассивКонструктораКлюча = ПолучитьПараметрыПодписиНаСервере(Объект.СвКлиент, Объект.ПользовательПодписант, 
			Объект.ПараметрНастроекПодписания);

	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.КонтурЛогистика_НастройкиПодписания", МассивКонструктораКлюча);
	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"РегистрСведений.КонтурЛогистика_НастройкиПодписания.Форма.ФормаЗаписи", Параметрыформы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандТабличнойЧастиСвГруз

&НаКлиенте
Процедура Подобрать(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Записать(); 
	КонецЕсли; 	 
 	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ПараметрыФормы.Вставить("НомДок", Объект.НомДок);
	ПараметрыФормы.Вставить("ДатаДок", Объект.ДатаДок);
	
	ПараметрыСозданияМаршрута = Новый Структура("НомДок, ДатаДок, Титул1, СвКлт, СвЭксп", 
			Объект.НомДок, Объект.ДатаДок, Объект.Ссылка, Объект.СвКлиент, Объект.СвЭксп);
	
	ПараметрыФормы.Вставить("ПараметрыСозданияМаршрута", ПараметрыСозданияМаршрута);
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ПолучитьПараметрыОткрытияМаршрутаНаСервере());

	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ФормаВыбора",
															 ПараметрыФормы, ЭтаФорма, ЭтаФорма, "ОбработчикПодбораДокументов");
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ЗаполнитьТаблицуМаршрутовГруза();
	ЗаполнитьГрузыПоМаршрутам();

	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Ссылка, Ложь);
	КодТекущегоСтатусаДокументооборота = ТекущийСтатусДокументооборота.Код;
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Титул2 = Документы.КонтурЛогистика_ПЭ_Титул2.НайтиПоРеквизиту("Титул1", Объект.Ссылка);	
	КонецЕсли;
	
	ВходящееПоручение = (ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен
	 		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
	 		Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением);
	
	СтатусСтрокой = Строка(ТекущийСтатус) + "; " + Строка(ТекущийСтатусДокументооборота);
	
	МожноВводитьСледующийТитул = ВходящееПоручение И Не ЗначениеЗаполнено(Титул2) И НЕ Объект.ЭтоВходящийШаблон;
			
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВвестиСледующийТитул.Видимость = МожноВводитьСледующийТитул;
	Элементы.Титул2.Видимость = ЗначениеЗаполнено(Титул2);
	
	Если Не ВходящееПоручение 
		И Не КодТекущегоСтатусаДокументооборота = "pe-completed"
		Или Объект.ЭтоВходящийШаблон Тогда 
	
		КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка,
			  Объект.ДокументОснование, Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию,
			  ТекущийСтатус, ТребуемоеДействие);
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.КнопкаПоУмолчанию = Истина;
		
		Если Объект.ЭтоШаблон Тогда
			Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Отправить шаблон заказчику";
		КонецЕсли;
	Иначе 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = Ложь;
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.КнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	
	Элементы.ФормаДокументКонтурЛогистика_ПЭ_Титул1ОтменитьПоручение.Видимость =
		КонтурЛогистика_ОбработкаДокументовСервер.ЕстьПропущенныеЗадачиПоПоручениюЭкспедитора(Объект.Ссылка);
	
	Элементы.ОтправительШаблона.Видимость = Объект.ЭтоШаблон И СоставляетИноеЛицо;
	Элементы.ЭтоШаблон.Видимость = (КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЭ_ИспользоватьШаблоныДокументов")
		ИЛИ Объект.ЭтоШаблон) И Не Объект.ЭтоВходящийШаблон;
		
	Элементы.ДокументШаблон.Видимость = ЗначениеЗаполнено(Объект.ДокументШаблон);
	Элементы.СценарийРедактированияШаблона.Видимость = Объект.ЭтоШаблон Или Объект.ЭтоВходящийШаблон;
	Элементы.Разделитель.Видимость = ЗначениеЗаполнено(Объект.Разделитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	ПолностьюОбновитьПредставлениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолностьюОбновитьПредставлениеДанных()

	// ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	ПроверитьДокумент(); // вызовет УправлениеВидимостьюИДоступностью();
	ПересчитатьЗаголовкиКоличества();
	РазвернутьСвернутьТаблицуГрузы();
	УстановитьЗаголовки();
	
	Элементы.ОтправительШаблона.Видимость = Объект.ЭтоШаблон И СоставляетИноеЛицо;	
	
КонецПроцедуры

&НаКлиенте
Функция ИспользоватьШаблоныДокументовПЭ()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЭ_ИспользоватьШаблоныДокументов");
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовки()
	
	Если Объект.ЭтоШаблон Тогда
		Заголовок = "Шаблон документа";
	ИначеЕсли Объект.ЭтоВходящийШаблон Тогда
		Заголовок = "Из шаблона";
	Иначе
		Заголовок = "";		
	КонецЕсли;

	Элементы.СвКлиент.Заголовок = ?(Объект.ЭтоШаблон, "Заказчик (получатель шаблона)", "Заказчик");
	Элементы.СвЭксп.Заголовок = ?(Объект.ЭтоШаблон И Не СоставляетИноеЛицо, "Экспедитор (отправитель шаблона)", "Экспедитор");
	
КонецПроцедуры	

&НаКлиенте
Процедура ПересчитатьЗаголовкиКоличества()

	Элементы.СтраницаМаршруты.Заголовок = "Маршруты / партии груза (" + МаршрутыГруза.Количество()  + ")";
	
	КоличествоТоваров = 0;
	Для Каждого Элемент Из Грузы.ПолучитьЭлементы() Цикл
		КоличествоТоваров = КоличествоТоваров + Элемент.ПолучитьЭлементы().Количество(); 
	КонецЦикла; 
	
	Элементы.СтраницаГрузы.Заголовок = "Грузы (" + 	КоличествоТоваров + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСвернутьТаблицуГрузы()
	
	Если Грузы.ПолучитьЭлементы().Количество() = 1 Тогда
		Для Каждого Элемент Из Грузы.ПолучитьЭлементы() Цикл
			Элементы.Грузы.Развернуть(Элемент.ПолучитьИдентификатор()); 
		КонецЦикла;
	КонецЕсли; 	  
	
КонецПроцедуры	

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()

	РезультатПроверки = ПроверитьДокументСервер();

    КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, КодТекущегоСтатусаДокументооборота = "zz-rejected");

	УправлениеВидимостьюИДоступностью(); 	// доступность команд

	Возврат РезультатПроверки;

КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДополнительныеДанные = Новый Структура("МаршрутыГруза", ВыгрузитьМаршруты());
	
	Если ДокОбъект.ЭтоШаблон Тогда
		ДополнительныеДанные.Вставить("ТребуетсяПодпись", Ложь);
	КонецЕсли;
	
	РезультатПроверки = Документы.КонтурЛогистика_ПЭ_Титул1.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок, ДополнительныеДанные, ТребуемоеДействие);

	Возврат РезультатПроверки;

КонецФункции

&НаКлиенте
Процедура ОбработатьТребуемоеДействие(ТребуемоеДействие, ПолеТаблицыОшибок = Неопределено)
	
	Если ПолеТаблицыОшибок <> Неопределено Тогда
		КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, ПолеТаблицыОшибок.Имя);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ВходящееПоручение = (ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен")
	 		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки") 
	 		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением"));	
	
	УстановитьТолькоПросмотр = (ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка")
		И КодТекущегоСтатусаДокументооборота <> "pe-wait-customer-sign")
		Или (Объект.ЭтоВходящийШаблон 
			И Объект.СценарийРедактированияШаблона = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СценарииРедактированияШаблона.НеРедактируется")) ;
	
	Элементы.ОсновнаяЧастьФормы.ТолькоПросмотр = УстановитьТолькоПросмотр;
	
	Элементы.ГруппаСтраницаДопПараметры.ТолькоПросмотр = УстановитьТолькоПросмотр;
	Элементы.СтраницаМаршруты.ТолькоПросмотр = УстановитьТолькоПросмотр;
	Элементы.ГруппаПЭ_ОбщиеДанные.ТолькоПросмотр = УстановитьТолькоПросмотр;
	
	Элементы.МаршрутыГрузаПодобрать.Доступность = Не УстановитьТолькоПросмотр;
	
	Элементы.ПерезаполнитьПоДокОснованию.Видимость =
		ЗначениеЗаполнено(Объект.ДокументОснование) И Не Объект.ЭтоВходящийШаблон;
	Элементы.ПерезаполнитьПоДокОснованию.Доступность = Не УстановитьТолькоПросмотр;
	
	ШаблонУправлениеВидимостью();
	УстановитьДоступностьКомандОтправки(Не УстановитьТолькоПросмотр);

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандОтправки(ДоступностьРедактирования)
	
	ПоказыватьНеподписанный = ДоступностьРедактирования И СценарийОтправлятьНеподписанныйПЭ();
	
	УстановитьВидимостьИДоступностьЭлементаФормы(
		"ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный", ПоказыватьНеподписанный);
	УстановитьВидимостьИДоступностьЭлементаФормы(
		"ФормаОбщаяКомандаКонтурЛогистика_ПодготовитьНеподписанныйКОтправке", ПоказыватьНеподписанный);
	
	ДоступностьПодписанного = ДоступностьРедактирования И СценарийОтправлятьПодписанныйПЭ();
	УстановитьДоступностьЭлементаФормы(
		"ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить", ДоступностьПодписанного);
	УстановитьДоступностьЭлементаФормы(
		"ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИПодготовитьКОтправке", ДоступностьПодписанного);
	
КонецПроцедуры

&НаСервере
Функция СценарийОтправлятьНеподписанныйПЭ()
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СценарийРазрешаетОтправкуНеподписанного(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1, Объект.ДокументОснование);
	
КонецФункции

&НаСервере
Функция СценарийОтправлятьПодписанныйПЭ()
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СценарийРазрешаетОтправкуПодписанного(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1, Объект.ДокументОснование);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементаФормы(ИмяЭлемента, Включить)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлемент.Видимость = Включить;
	НайденныйЭлемент.Доступность = Включить;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементаФормы(ИмяЭлемента, Включить)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлемент.Доступность = Включить;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонУправлениеВидимостью()
	
	ЭтоШаблонДокумента = Объект.ЭтоШаблон;
	Элементы.ПользовательПодписант.Видимость = Не ЭтоШаблонДокумента
		Или КодТекущегоСтатусаДокументооборота = "pe-wait-customer-sign";
	Элементы.СоставляетИноеЛицо.Видимость = ЭтоШаблонДокумента;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		Объект.ДокументыОснованияМаршрутов.Очистить();
		
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("ДокументОснование", ДокОбъект.ДокументОснование);
		ДанныеЗаполнения.Вставить("Перезаполнить", Истина);
		ДанныеЗаполнения.Вставить("Разделитель", ДокОбъект.Разделитель);
		
		ДокОбъект.Заполнить(ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("МассивПартий") Тогда 
			МаршрутыГруза.Очистить();
			ЗагрузитьМассивВКолонку(МаршрутыГруза, ДанныеЗаполнения.МассивПартий);
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Модифицированность = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)

	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);

	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);

	Если Элемент.Имя = "ДокУчСист_Грузоотправитель_Сопоставить"
		 Или Элемент.Имя = "ДокУчСист_Перевозчик_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ПунктПод_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ПунктыМаршрута";

	Иначе

		ВызватьИсключение "не реализовано";

	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора",
																   ПараметрыФормыПоиска,
																   ЭтаФорма,
																   ЭтаФорма,
																   "ОбработчикВыбораСопоставленияРеквизитаДокумента",
																   ПараметрыОбработчика);
КонецПроцедуры
															   
&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание

		ПолностьюОбновитьПредставлениеДанных();

		ОбновитьДанныеФормы();

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()

	Перем МассивКонвертируемыхРеквизитов;

	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("ПунктПод", "ПунктПод");
	МассивКонвертируемыхРеквизитов.Вставить("Грузоотправитель", "Грузоотправитель");
	МассивКонвертируемыхРеквизитов.Вставить("Перевозчик", "Перевозчик");
	
	Возврат МассивКонвертируемыхРеквизитов;

КонецФункции

&НаКлиенте
Процедура ПоказатьЗначенияДокументаУчетнойСистемы(Команда)
	
	РеквизитыУчетногоДокументаВидимы = Не РеквизитыУчетногоДокументаВидимы;
	Если РеквизитыУчетногоДокументаВидимы Тогда 
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Скрыть;
	Иначе
		Элементы.ФормаПоказатьЗначенияДокументаУчетнойСистемы.Картинка = БиблиотекаКартинок.КонтурЛогистика_Показать;
	КонецЕсли;
	
	СкрытьПоказатьЗначенияДокУчСист();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьЗначенияДокУчСист()
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуМаршрутовГруза()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос = Документы.КонтурЛогистика_ПЭ_Титул1.ПолучитьЗапросСпискаДокументовМаршрута(Объект.Ссылка);
		СсылкиНаМаршрут = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе 
		Если Параметры.Свойство("ЗначенияЗаполнения") И  Параметры.ЗначенияЗаполнения.Свойство("МассивПартий") Тогда
			СсылкиНаМаршрут = Параметры.ЗначенияЗаполнения.МассивПартий;
		КонецЕсли; 	
	КонецЕсли; 	  
	
	ЗагрузитьМассивВКолонку(МаршрутыГруза, СсылкиНаМаршрут);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТитулВДокументахМаршута(МассивСсылок, Титул1)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	(НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Титул1 = &Титул1
	|		Или &БылиИзмененыРеквизиты) 
	|   И КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка В (&МассивСсылок)" ;
	
	Запрос.УстановитьПараметр("Титул1", Титул1);
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("БылиИзмененыРеквизиты", ИзмененыКлючевыеРеквизиты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументМаршрут = Выборка.Ссылка.ПолучитьОбъект();
		ДокументМаршрут.Титул1 = Титул1;
		
		// Установим ключевые реквизиты
		ДокументМаршрут.СвКлт = Объект.СвКлиент;
		ДокументМаршрут.СвЭксп = Объект.СвЭксп;
		ДокументМаршрут.НомДок = Объект.НомДок;
		ДокументМаршрут.ДатаДок = Объект.ДатаДок;
		ДокументМаршрут.ДогТрЭксп = Объект.ДогТрЭксп; 
		
		ДокументМаршрут.Записать();
	КонецЦикла;
	
	ИзмененыКлючевыеРеквизиты = Ложь;	
	
КонецПроцедуры		

&НаСервере
Процедура ЗагрузитьМассивВКолонку(ТаблицаЗначений, ИсходныйМассив, Знач ИмяКолонки = "МаршрутГруза")
	
	Если ЗначениеЗаполнено(ИсходныйМассив) Тогда

		Для Каждого Элемент Из ИсходныйМассив Цикл
			Если ТаблицаЗначений.НайтиСтроки(Новый Структура("МаршрутГруза", Элемент)).Количество() = 0 Тогда
				СтрокаТЗ = ТаблицаЗначений.Добавить();
				СтрокаТЗ[ИмяКолонки] = Элемент;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ВыгрузитьМаршруты()
	
	МассивМаршрутов = Новый Массив;
	
	Для Каждого Маршрут Из МаршрутыГруза Цикл
		МассивМаршрутов.Добавить(Маршрут.МаршрутГруза); 
	КонецЦикла;
	
	Возврат МассивМаршрутов;
	
КонецФункции

&НаСервере
Процедура ПерепроверитьМаршрутыГрузаНаСервере()
	
	МассивМаршрутов = ВыгрузитьМаршруты();
	Если МассивМаршрутов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ЗаполненностьКакПредупреждение = Документы.КонтурЛогистика_ПЭ_Титул1.ЭтоОтправкаНезаблокированногоШаблона(ДокОбъект);
	
	Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ОбновитьВалидациюДокументов(
		МассивМаршрутов, ЗаполненностьКакПредупреждение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()

	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	Представления = ПолучитьПредставлениеРеквизитовДокументаОснования(Объект.ДокументОснование, Объект);
	
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		
		Значение = Неопределено;
		ИмяЭлементаЛогистика = Эл.Значение; // сконвертированного
		ИмяЭлементаНадписиСопоставить = "ДокУчСист_" + Эл.Ключ + "_Сопоставить";
		ИмяЭлементаЗначениеИзДокУчСист = "ДокУчСист_" + Эл.Ключ;
		
		
		Если Представления.Свойство(Эл.Ключ, Значение) Тогда
			
			ЭтаФорма["ДокУчСист_" + Эл.Ключ] = Значение;
			
			// определим доступность команды сопоставления
			
			Если ЗначениеЗаполнено(ИмяЭлементаЛогистика) Тогда
				
				ПутьПроверкиДанных = Элементы.Найти(ИмяЭлементаЛогистика).ПутьКДанным;
				
				РеквизитИзвлеченИзДокумента = ЗначениеЗаполнено(Этаформа[ИмяЭлементаЗначениеИзДокУчСист]);
				
				Если РеквизитИзвлеченИзДокумента Тогда // если этот элемент выведен на форму и он рассчитан из документа уч сист
					
					Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
						
						ЗначениеВРеквизите = Вычислить(ПутьПроверкиДанных);
						НужноСопоставить = Не ЗначениеЗаполнено(ЗначениеВРеквизите);
						
					Иначе
						
						НужноСопоставить = Ложь;
						
					КонецЕсли;
					
					Элементы.Найти(ИмяЭлементаЛогистика).Видимость = Не НужноСопоставить;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = НужноСопоставить;
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = НужноСопоставить ИЛИ РеквизитыУчетногоДокументаВидимы;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Заголовок = "Сопоставить";
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Установить новое соответствие";
					
				Иначе // не извлечен из документа Уч сист
					
					Элементы.Найти(ИмяЭлементаЗначениеИзДокУчСист).Видимость = Ложь;
					Элементы.Найти(ИмяЭлементаНадписиСопоставить).Видимость = Ложь;
					
					Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
						
						Элементы.Найти(ИмяЭлементаНадписиСопоставить).Подсказка = "Не извлечен или не заполнен в док. основании. Открыть исходный документ";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если Элементы.Найти(ИмяЭлементаЛогистика) <> Неопределено Тогда
				Элементы.Найти(ИмяЭлементаЛогистика).Видимость 	= Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРеквизитовДокументаОснования(ДокументОснование, Знач ДокументТитулОбъект)

	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();

	СтруктураПредставлений = Новый Структура();
	Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
		СтруктураПредставлений.Вставить(Эл.Ключ);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
									Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1,
									ДокументОснование);
		
		Если НастройкаКонвертации <> Неопределено Тогда
			
			Переменные = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьПеременные(ДокументТитулОбъект, ДокументОснование, НастройкаКонвертации, "");
			
			Для Каждого Эл Из МассивКонвертируемыхРеквизитов Цикл
				
				НастройкаКонвертацииРеквизита = НастройкаКонвертации.ПравилаКонвертацииТитулаРеквизиты.Найти(Эл.Ключ,
					"РеквизитТитула");
					ТекущийОбъектДляВычисления = ДокументТитулОбъект;
				
				Если НастройкаКонвертацииРеквизита = Неопределено Тогда 
					Сообщить("В настройках конвертации документов не указано правило конвертации для реквизита: " + Эл.Ключ);
					Продолжить;
				КонецЕсли;	
				
				РезультатВычисления = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьРеквизитОснования(ДокументОснование,
					НастройкаКонвертацииРеквизита,
					НастройкаКонвертации,
					ТекущийОбъектДляВычисления,
					Ложь,
					Переменные);
				
				Если РезультатВычисления.Успешно Тогда
					СтруктураПредставлений.Вставить("ДокУчСист_" + Эл.Ключ, РезультатВычисления.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат СтруктураПредставлений;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыПодписиНаСервере(ОрганизацияДиадок, Пользователь1С, ДопПараметр)
	
	ДатаПодписи = ТекущаяДатаСеанса();
	
	// получаем из-за среза 
	ПодписантСтруктура = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(ОрганизацияДиадок, Пользователь1С, 
		ДатаПодписи, , ДопПараметр);
	
	СтруктураЗаписи = Новый Структура("ОрганизацияДиадок, Пользователь1С, СертификатНаСервере, ДопПараметр, Период",
				ОрганизацияДиадок, ПодписантСтруктура.Пользователь1С, ПодписантСтруктура.ЭтоСерверныйСертификат,
				ПодписантСтруктура.ДопПараметр, ПодписантСтруктура.ДатаЗаписи);
			
	МассивКонструктораКлюча = Новый Массив;
	МассивКонструктораКлюча.Добавить(СтруктураЗаписи);
	
	Возврат МассивКонструктораКлюча;		
	
КонецФункции

&НаКлиенте
Процедура СформироватьЗаголовокГруппыРеквизитыДокумента()
	
	Если ЗначениеЗаполнено(Объект.СвКлиент) Тогда 
		Заказчик = "Заказчик: " + Строка(Объект.СвКлиент) + " ";
	Иначе 
		Заказчик = "";	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.СвЭксп) Тогда 
		Экспедитор = "Экспедитор: " + Строка(Объект.СвЭксп) + " ";
	Иначе 
		Экспедитор = "";	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ДогТрЭксп) Тогда 
		Договор = "Договор: " + Строка(Объект.ДогТрЭксп) + " ";
	Иначе 
		Договор = "";	
	КонецЕсли;
	
	Элементы.ГруппаРеквизитыШапки.ЗаголовокСвернутогоОтображения = "Реквизиты ПЭ " + Заказчик + Экспедитор + Договор;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьГрузыПоМаршрутам()
	
 	Запрос = Новый Запрос;
 	Запрос.Текст = "ВЫБРАТЬ
 	               |	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.ОтгрузочноеНаименование КАК Наименование,
 	               |	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.КоличествоМест КАК КоличествоМест,
 	               |	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.ОбъемКубМ КАК Объем,
 	               |	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.МассаБруттоКг КАК МассаБрутто,
 	               |	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.СтоимостьГруза КАК Стоимость,
 	               |	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.ВалютаУчетаГруза КАК Валюта,
 	               |	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка КАК Ссылка
 	               |ИЗ
 	               |	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Товары КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары
 	               |ГДЕ
 	               |	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутТовары.Ссылка В(&МассивМаршрутов)
 	               |ИТОГИ
 	               |	МАКСИМУМ(Ссылка) КАК Наименование,
 	               |	СУММА(КоличествоМест),
 	               |	СУММА(Объем),
 	               |	СУММА(МассаБрутто),
 	               |	СУММА(Стоимость),
 	               |	МАКСИМУМ(Валюта)
 	               |ПО
 	               |	Ссылка";

 	
 	Запрос.УстановитьПараметр("МассивМаршрутов", МаршрутыГруза.Выгрузить().ВыгрузитьКолонку("МаршрутГруза"));
 	ДЗДанныеТоваров = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
 	
 	ЗначениеВРеквизитФормы(ДЗДанныеТоваров, "Грузы");
 	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОткрытияМаршрутаНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЭтоШаблонТитула", ДокОбъект.ЭтоШаблон);
	ПараметрыОткрытия.Вставить("ЭтоВходящийШаблон", ДокОбъект.ЭтоВходящийШаблон);
	ПараметрыОткрытия.Вставить("ЗаполненностьКакПредупреждение",
		Документы.КонтурЛогистика_ПЭ_Титул1.ЭтоОтправкаНезаблокированногоШаблона(ДокОбъект));
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции
